; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared2 - mode
	image0 - mode
	spectrograph1 - mode
	Star3 - direction
	Star2 - direction
	Star1 - direction
	GroundStation4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Planet21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Star24 - direction
	Star25 - direction
	Planet26 - direction
	Phenomenon27 - direction
	Phenomenon28 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument5 image0)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 spectrograph1)
	(supports instrument8 image0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet16)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon6 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Planet8 infrared2)
	(have_image Phenomenon9 infrared2)
	(have_image Planet11 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 spectrograph1)
	(have_image Planet16 image0)
	(have_image Planet17 image0)
	(have_image Star18 infrared2)
	(have_image Phenomenon19 image0)
	(have_image Star20 image0)
	(have_image Planet21 infrared2)
	(have_image Star22 infrared2)
	(have_image Phenomenon23 image0)
	(have_image Star24 image0)
	(have_image Planet26 infrared2)
	(have_image Phenomenon27 infrared2)
	(have_image Phenomenon28 infrared2)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 22
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 22
3. (turn_to satellite4 phenomenon14 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 22
4. (turn_to satellite4 star1 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 star1)
   goals met: 0 of 22
5. (calibrate satellite4 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 22
6. (turn_to satellite4 phenomenon14 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 22
7. (take_image satellite4 phenomenon14 instrument6 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 1 of 22
8. (turn_to satellite4 phenomenon27 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon27)
   goals met: 1 of 22
9. (take_image satellite4 phenomenon27 instrument6 infrared2)
   added: (have_image phenomenon27 infrared2)
   goals met: 2 of 22
10. (turn_to satellite4 phenomenon28 phenomenon27)
   deleted: (pointing satellite4 phenomenon27)
   added: (pointing satellite4 phenomenon28)
   goals met: 2 of 22
11. (take_image satellite4 phenomenon28 instrument6 infrared2)
   added: (have_image phenomenon28 infrared2)
   goals met: 3 of 22
12. (turn_to satellite4 phenomenon6 phenomenon28)
   deleted: (pointing satellite4 phenomenon28)
   added: (pointing satellite4 phenomenon6)
   goals met: 3 of 22
13. (take_image satellite4 phenomenon6 instrument6 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 4 of 22
14. (turn_to satellite4 phenomenon7 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon7)
   goals met: 4 of 22
15. (take_image satellite4 phenomenon7 instrument6 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 5 of 22
16. (turn_to satellite4 phenomenon9 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon9)
   goals met: 5 of 22
17. (take_image satellite4 phenomenon9 instrument6 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 6 of 22
18. (turn_to satellite4 planet21 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet21)
   goals met: 6 of 22
19. (take_image satellite4 planet21 instrument6 infrared2)
   added: (have_image planet21 infrared2)
   goals met: 7 of 22
20. (turn_to satellite4 planet26 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet26)
   goals met: 7 of 22
21. (take_image satellite4 planet26 instrument6 infrared2)
   added: (have_image planet26 infrared2)
   goals met: 8 of 22
22. (turn_to satellite4 planet8 planet26)
   deleted: (pointing satellite4 planet26)
   added: (pointing satellite4 planet8)
   goals met: 8 of 22
23. (take_image satellite4 planet8 instrument6 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 9 of 22
24. (turn_to satellite4 star18 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star18)
   goals met: 9 of 22
25. (take_image satellite4 star18 instrument6 infrared2)
   added: (have_image star18 infrared2)
   goals met: 10 of 22
26. (turn_to satellite4 star22 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star22)
   goals met: 10 of 22
27. (take_image satellite4 star22 instrument6 infrared2)
   added: (have_image star22 infrared2)
   goals met: 11 of 22
28. (turn_to satellite0 phenomenon15 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon15)
   goals met: 11 of 22
29. (turn_to satellite0 phenomenon5 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon5)
   goals met: 12 of 22
30. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   goals met: 11 of 22
31. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 11 of 22
32. (turn_to satellite0 phenomenon15 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon15)
   goals met: 11 of 22
33. (take_image satellite0 phenomenon15 instrument0 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 12 of 22
34. (turn_to satellite0 phenomenon19 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon19)
   goals met: 12 of 22
35. (take_image satellite0 phenomenon19 instrument0 image0)
   added: (have_image phenomenon19 image0)
   goals met: 13 of 22
36. (turn_to satellite0 phenomenon23 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon23)
   goals met: 13 of 22
37. (take_image satellite0 phenomenon23 instrument0 image0)
   added: (have_image phenomenon23 image0)
   goals met: 14 of 22
38. (turn_to satellite0 phenomenon5 phenomenon23)
   deleted: (pointing satellite0 phenomenon23)
   added: (pointing satellite0 phenomenon5)
   goals met: 15 of 22
39. (take_image satellite0 phenomenon5 instrument0 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 16 of 22
40. (turn_to satellite0 planet11 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet11)
   goals met: 15 of 22
41. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 16 of 22
42. (turn_to satellite0 phenomenon5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon5)
   goals met: 17 of 22
43. (turn_to satellite0 planet16 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet16)
   goals met: 16 of 22
44. (take_image satellite0 planet16 instrument0 image0)
   added: (have_image planet16 image0)
   goals met: 17 of 22
45. (turn_to satellite0 phenomenon5 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon5)
   goals met: 18 of 22
46. (turn_to satellite0 planet17 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet17)
   goals met: 17 of 22
47. (take_image satellite0 planet17 instrument0 image0)
   added: (have_image planet17 image0)
   goals met: 18 of 22
48. (turn_to satellite0 phenomenon5 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 phenomenon5)
   goals met: 19 of 22
49. (turn_to satellite0 star13 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star13)
   goals met: 18 of 22
50. (take_image satellite0 star13 instrument0 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 19 of 22
51. (turn_to satellite0 phenomenon5 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon5)
   goals met: 20 of 22
52. (turn_to satellite0 star20 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star20)
   goals met: 19 of 22
53. (take_image satellite0 star20 instrument0 image0)
   added: (have_image star20 image0)
   goals met: 20 of 22
54. (turn_to satellite0 phenomenon5 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 phenomenon5)
   goals met: 21 of 22
55. (turn_to satellite0 star24 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star24)
   goals met: 20 of 22
56. (take_image satellite0 star24 instrument0 image0)
   added: (have_image star24 image0)
   goals met: 21 of 22
57. (turn_to satellite0 phenomenon5 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 phenomenon5)
   goals met: 22 of 22
